In [1]:
import numpy as np
import pandas as pd

# Q1: Working with Pandas Series

## Q1.1
Create a Pandas Series consisting of numbers from 1 to 13 using numpy array

In [2]:
x = pd.Series(np.arange(1,14))
x

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
dtype: int32

## Q 1.2 
Add index column name as index_column and add series name as pandas_series

In [3]:
x.name = 'pandas_series'
x.index.name = 'index_column'
x

index_column
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
Name: pandas_series, dtype: int32

## Q 1.3 

Create a dataframe using the pandas series defined above

In [4]:
df = pd.DataFrame(x)
df

              pandas_series
index_column
0                         1
1                         2
2                         3
3                         4
4                         5
5                         6
6                         7
7                         8
8                         9
9                        10
10                       11
11                       12
12                       13

## Q 1.4

Create another pandas series with numbers from 0 to 13 but in reverse order

In [5]:
x_rev = pd.Series(np.arange(13,0,-1))
x_rev

0     13
1     12
2     11
3     10
4      9
5      8
6      7
7      6
8      5
9      4
10     3
11     2
12     1
dtype: int32

## Q 1.5 

Assign series name as pandas_series2

In [6]:
x_rev.name = 'pandas_series2'
x_rev

0     13
1     12
2     11
3     10
4      9
5      8
6      7
7      6
8      5
9      4
10     3
11     2
12     1
Name: pandas_series2, dtype: int32

# Q2: Dataframe from Python dictionary


## Q 2.1

Create a Python dictionary using both series defined above.

In [7]:
df_dict = {'first':x.values,'second':x_rev.values}
df_dict

{'first': array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13]),
 'second': array([13, 12, 11, 10,  9,  8,  7,  6,  5,  4,  3,  2,  1])}

## Q 2.2 
Use the dictionary defined above to create a Python Dataframe with column names series_1 and series_2 respectively

In [8]:
df = pd.DataFrame(df_dict)
df.columns=['series_1','series_2']
df

    series_1  series_2
0          1        13
1          2        12
2          3        11
3          4        10
4          5         9
5          6         8
6          7         7
7          8         6
8          9         5
9         10         4
10        11         3
11        12         2
12        13         1

## Q 2.3

Rename column names to val_1 and val_2 respectively

In [9]:
df.columns=['val_1','val_2']
df

    val_1  val_2
0       1     13
1       2     12
2       3     11
3       4     10
4       5      9
5       6      8
6       7      7
7       8      6
8       9      5
9      10      4
10     11      3
11     12      2
12     13      1

## Q 2.4

Rename index column name as index_col

In [10]:
df.index.name ='index_col'
df

           val_1  val_2
index_col
0              1     13
1              2     12
2              3     11
3              4     10
4              5      9
5              6      8
6              7      7
7              8      6
8              9      5
9             10      4
10            11      3
11            12      2
12            13      1

# Q3: Working with Pandas data types

## Q 3.1
Create a data frame with 6 different dtypes (not necessarily in the same order)

>* datetime64
>* ndarray
>* float64
>* int32
>* int64
>* Categorical
>* string

You should demonstrate the use of pandas Series and NumPy arrays. 
Hint: Use the example done in the lecture

In [11]:
df1 = pd.DataFrame(
    {
        "A": np.random.rand(5),
        "C": ['Mike','Harvey','Jake','Jon','Sam'],
        "D": pd.Timestamp("20020502"),
        "G": pd.Series([4] * 5, dtype="int32"),
        "H": pd.Series([56] * 5).astype("int64"),
        "cat": ['a','b','c','d','e'],
        "E": pd.Series([2.0] * 5).astype("float64")
    }
)
df1

          A       C          D  G   H cat    E
0  0.169717    Mike 2002-05-02  4  56   a  2.0
1  0.257064  Harvey 2002-05-02  4  56   b  2.0
2  0.275386    Jake 2002-05-02  4  56   c  2.0
3  0.095157     Jon 2002-05-02  4  56   d  2.0
4  0.982684     Sam 2002-05-02  4  56   e  2.0

## Q 3.2

Print the different data types

In [12]:
df1.dtypes

A             float64
C              object
D      datetime64[ns]
G               int32
H               int64
cat            object
E             float64
dtype: object

## Q 3.3

Change col_1 data type to int32 and col_4 data type to float64

In [13]:
df1 = df1.astype({"A":int,"G":float})
df1.dtypes

A               int32
C              object
D      datetime64[ns]
G             float64
H               int64
cat            object
E             float64
dtype: object

## Q 3.4 

Create a series from the col_4

In [14]:
df_series = pd.Series(df1['G'])
df_series

0    4.0
1    4.0
2    4.0
3    4.0
4    4.0
Name: G, dtype: float64

## Q 3.5

Verify that the above series and dataframe are pandas series and dataframe respectively

In [15]:
# type your code below
df_series.equals(df1['G'])

True

# Q4: Creating a DataFrame

## Q 4.1

Create a pandas dataframe as shown below

![Series vs. Dataframe ](https://drive.google.com/uc?export=view&id=1LUK-Px0uf8UkQOA4b1XhzBZzqrRLPVkt)

In [16]:
stds = pd.DataFrame({
        'student_id': [2,10,4,5,1,7,8,6,9,3],
        'student_name': ['Araceli','Martin','Diann','Stacey','Leticia','Roxane','Venice','Jacq','Erich','Linda'],
        'student_age': [23,45,26,32,29,34,24,27,38,35],
        'student_gender': ['M','F','TG','F','M','F','TG','F','M','F'],
        'student_course': ['PP','EX','PP','NPP','EX','NPP','PP','NPP','PP','NPP']
    })
stds

   student_id student_name  student_age student_gender student_course
0           2      Araceli           23              M             PP
1          10       Martin           45              F             EX
2           4        Diann           26             TG             PP
3           5       Stacey           32              F            NPP
4           1      Leticia           29              M             EX
5           7       Roxane           34              F            NPP
6           8       Venice           24             TG             PP
7           6         Jacq           27              F            NPP
8           9        Erich           38              M             PP
9           3        Linda           35              F            NPP

## Q 4.2 

Print the top 3 rows

In [17]:
stds.head(3)

   student_id student_name  student_age student_gender student_course
0           2      Araceli           23              M             PP
1          10       Martin           45              F             EX
2           4        Diann           26             TG             PP

## Q 4.3

Display the column names

In [18]:
stds.columns

Index(['student_id', 'student_name', 'student_age', 'student_gender',
       'student_course'],
      dtype='object')

## Q 4.4

Print the bottom 4 rows

In [19]:
stds.tail(4)

   student_id student_name  student_age student_gender student_course
6           8       Venice           24             TG             PP
7           6         Jacq           27              F            NPP
8           9        Erich           38              M             PP
9           3        Linda           35              F            NPP

## Q 4.5

Display the index

In [20]:
stds.index

RangeIndex(start=0, stop=10, step=1)

# Q5: Dataframe to NumPy array

## Q 5.1

Convert the above student records dataframe to a numpy array

In [21]:
stds_np = stds.to_numpy()
stds_np

array([[2, 'Araceli', 23, 'M', 'PP'],
       [10, 'Martin', 45, 'F', 'EX'],
       [4, 'Diann', 26, 'TG', 'PP'],
       [5, 'Stacey', 32, 'F', 'NPP'],
       [1, 'Leticia', 29, 'M', 'EX'],
       [7, 'Roxane', 34, 'F', 'NPP'],
       [8, 'Venice', 24, 'TG', 'PP'],
       [6, 'Jacq', 27, 'F', 'NPP'],
       [9, 'Erich', 38, 'M', 'PP'],
       [3, 'Linda', 35, 'F', 'NPP']], dtype=object)

## Q 5.2 
Save the above numpy array to a binary file in NumPy

In [22]:
np.save('numpy_binary', stds_np)

## Q 5.3

Load the saved array and print the contents

Note: Loading files that contain object arrays uses the pickle module. Check the syntax of the command how to use that.

In [23]:
# type your code below
np.load('numpy_binary.npy',allow_pickle=True)

array([[2, 'Araceli', 23, 'M', 'PP'],
       [10, 'Martin', 45, 'F', 'EX'],
       [4, 'Diann', 26, 'TG', 'PP'],
       [5, 'Stacey', 32, 'F', 'NPP'],
       [1, 'Leticia', 29, 'M', 'EX'],
       [7, 'Roxane', 34, 'F', 'NPP'],
       [8, 'Venice', 24, 'TG', 'PP'],
       [6, 'Jacq', 27, 'F', 'NPP'],
       [9, 'Erich', 38, 'M', 'PP'],
       [3, 'Linda', 35, 'F', 'NPP']], dtype=object)

# Q6: Statistic Summary

## Q 6.1

Generate statistic summary of your data

In [24]:
stds.describe(include='all')

        student_id student_name  student_age student_gender student_course
count     10.00000           10    10.000000             10             10
unique         NaN           10          NaN              3              3
top            NaN      Leticia          NaN              F             PP
freq           NaN            1          NaN              5              4
mean       5.50000          NaN    31.300000            NaN            NaN
std        3.02765          NaN     6.896859            NaN            NaN
min        1.00000          NaN    23.000000            NaN            NaN
25%        3.25000          NaN    26.250000            NaN            NaN
50%        5.50000          NaN    30.500000            NaN            NaN
75%        7.75000          NaN    34.750000            NaN            NaN
max       10.00000          NaN    45.000000            NaN            NaN

## Q 6.2 
Explain the results you obtained above

############# Write your answer below  ####################

# Q7: Dataframe transpose

## Q 7.1

Transpose your data frame

In [25]:
students_T = stds.T
students_T

,0,1,2,3,4,5,6,7,8,9
student_id,2,10,4,5,1,7,8,6,9,3
student_name,Araceli,Martin,Diann,Stacey,Leticia,Roxane,Venice,Jacq,Erich,Linda
student_age,23,45,26,32,29,34,24,27,38,35
student_gender,M,F,TG,F,M,F,TG,F,M,F
student_course,PP,EX,PP,NPP,EX,NPP,PP,NPP,PP,NPP

## Q 7.2

Calculate the descriptive statistics of the transposed dataframe

In [26]:
students_T.describe(include='all')

              0       1   2   3  4   5  6     7  8  9
count         5       5   5   5  5   5  5     5  5  5
unique        5       5   5   5  5   5  5     5  5  5
top     Araceli  Martin  PP  32  1  34  8  Jacq  9  3
freq          1       1   1   1  1   1  1     1  1  1

## Q 7.3

Compare this with the initial descriptive statistics -  what do you conclude based on both descriptive startics?

############# Write your answer below  ####################

# Q8: Sorting

## Q 8.1

Sort the values as per column name in descending order

In [27]:
stds.sort_values('student_name',ascending=False)

   student_id student_name  student_age student_gender student_course
6           8       Venice           24             TG             PP
3           5       Stacey           32              F            NPP
5           7       Roxane           34              F            NPP
1          10       Martin           45              F             EX
9           3        Linda           35              F            NPP
4           1      Leticia           29              M             EX
7           6         Jacq           27              F            NPP
8           9        Erich           38              M             PP
2           4        Diann           26             TG             PP
0           2      Araceli           23              M             PP

## Q 8.2

Sort in descending index order

In [28]:
# type your code below
s1 = stds.sort_index(ascending=False)
s1

   student_id student_name  student_age student_gender student_course
9           3        Linda           35              F            NPP
8           9        Erich           38              M             PP
7           6         Jacq           27              F            NPP
6           8       Venice           24             TG             PP
5           7       Roxane           34              F            NPP
4           1      Leticia           29              M             EX
3           5       Stacey           32              F            NPP
2           4        Diann           26             TG             PP
1          10       Martin           45              F             EX
0           2      Araceli           23              M             PP

## Q 8.3 

Sort the values as per column name in descending order and with descending index order

In [29]:
s1.sort_values('student_name',ascending=False)

   student_id student_name  student_age student_gender student_course
6           8       Venice           24             TG             PP
3           5       Stacey           32              F            NPP
5           7       Roxane           34              F            NPP
1          10       Martin           45              F             EX
9           3        Linda           35              F            NPP
4           1      Leticia           29              M             EX
7           6         Jacq           27              F            NPP
8           9        Erich           38              M             PP
2           4        Diann           26             TG             PP
0           2      Araceli           23              M             PP

## Q 8.4

sort the values of your dataframe using your student id

In [30]:
stds.sort_values('student_id')

   student_id student_name  student_age student_gender student_course
4           1      Leticia           29              M             EX
0           2      Araceli           23              M             PP
9           3        Linda           35              F            NPP
2           4        Diann           26             TG             PP
3           5       Stacey           32              F            NPP
7           6         Jacq           27              F            NPP
5           7       Roxane           34              F            NPP
6           8       Venice           24             TG             PP
8           9        Erich           38              M             PP
1          10       Martin           45              F             EX

# Q9: Slicing and Selection

Use iloc for the below questions


## Q 9.1

Print 2 and 4th rows

In [31]:
stds.iloc[[1,3]]

   student_id student_name  student_age student_gender student_course
1          10       Martin           45              F             EX
3           5       Stacey           32              F            NPP

## Q 9.2

Display the student name and gender for 3rd and 8th record

In [32]:
stds.iloc[[2,7]][['student_name','student_gender']]

  student_name student_gender
2        Diann             TG
7         Jacq              F

## Q 9.3 

Select 2nd to 5th row and 2nd to 4th col

In [33]:
stds.iloc[1:5,1:4]

  student_name  student_age student_gender
1       Martin           45              F
2        Diann           26             TG
3       Stacey           32              F
4      Leticia           29              M

Note: Use loc for the questions below

## Q 9.4

Display the 4th record

In [34]:
stds.loc[4]

student_id              1
student_name      Leticia
student_age            29
student_gender          M
student_course         EX
Name: 4, dtype: object

## Q 9.5 

Select ONLY the student name for index = 6

In [35]:
stds.loc[6]['student_name']

'Venice'

# Q 10 Conditional Selection

## Q 10.1

Print all students whose age is higher than or equal to 27

In [36]:
stds.loc[stds.student_age>=27]

   student_id student_name  student_age student_gender student_course
1          10       Martin           45              F             EX
3           5       Stacey           32              F            NPP
4           1      Leticia           29              M             EX
5           7       Roxane           34              F            NPP
7           6         Jacq           27              F            NPP
8           9        Erich           38              M             PP
9           3        Linda           35              F            NPP

## Q 10.2

Print only the student names whose age is higher than 27

In [37]:
stds.loc[stds.student_age>=27,['student_name']]

  student_name
1       Martin
3       Stacey
4      Leticia
5       Roxane
7         Jacq
8        Erich
9        Linda

## Q 10.3

Select records of all students whose age is higher than 27 and are males

In [38]:
stds.loc[(stds.student_age>=27) & (stds.student_gender=='M')]

   student_id student_name  student_age student_gender student_course
4           1      Leticia           29              M             EX
8           9        Erich           38              M             PP

## Q 10.4

Select all student names which contains the letter r

# type your code below

In [39]:
import re
stds.loc[stds['student_name'].str.contains('r', regex=True)]

   student_id student_name  student_age student_gender student_course
0           2      Araceli           23              M             PP
1          10       Martin           45              F             EX
8           9        Erich           38              M             PP

## Q 10.5

Select all student names which contains the letter r and are male

In [40]:
stds.loc[(stds['student_name'].str.contains('r', regex=True)) & (stds.student_gender=='M')]

   student_id student_name  student_age student_gender student_course
0           2      Araceli           23              M             PP
8           9        Erich           38              M             PP

## Q 10.6

Select all students whose name contains r or e (case insensitive) and are females

Hinte: Use regex

In [41]:
stds.loc[stds['student_name'].str.contains('r|e', regex=True)]

   student_id student_name  student_age student_gender student_course
0           2      Araceli           23              M             PP
1          10       Martin           45              F             EX
3           5       Stacey           32              F            NPP
4           1      Leticia           29              M             EX
5           7       Roxane           34              F            NPP
6           8       Venice           24             TG             PP
8           9        Erich           38              M             PP

# Q11: Miscellaneous questions

## Q 11.1

Get a list of students names from the data frame

In [42]:
stds['student_name'].tolist()

['Araceli',
 'Martin',
 'Diann',
 'Stacey',
 'Leticia',
 'Roxane',
 'Venice',
 'Jacq',
 'Erich',
 'Linda']

## Q 11.2

Get a dictionary of students names from the data frame

In [43]:
df_dict = {'name':stds['student_name'].tolist()}
print(df_dict)

{'name': ['Araceli', 'Martin', 'Diann', 'Stacey', 'Leticia', 'Roxane', 'Venice', 'Jacq', 'Erich', 'Linda']}